/*
//@HEADER
// ************************************************************************
//
//                        Kokkos v. 2.0
//              Copyright (2014) Sandia Corporation
//
// Under the terms of Contract DE-AC04-94AL85000 with Sandia Corporation,
// the U.S. Government retains certain rights in this software.
//
// Redistribution and use in source and binary forms, with or without
// modification, are permitted provided that the following conditions are
// met:
//
// 1. Redistributions of source code must retain the above copyright
// notice, this list of conditions and the following disclaimer.
//
// 2. Redistributions in binary form must reproduce the above copyright
// notice, this list of conditions and the following disclaimer in the
// documentation and/or other materials provided with the distribution.
//
// 3. Neither the name of the Corporation nor the names of the
// contributors may be used to endorse or promote products derived from
// this software without specific prior written permission.
//
// THIS SOFTWARE IS PROVIDED BY SANDIA CORPORATION "AS IS" AND ANY
// EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
// IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
// PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL SANDIA CORPORATION OR THE
// CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
// EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
// PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
// PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
// LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
// NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
// SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//
// Questions? Contact  H. Carter Edwards (hcedwar@sandia.gov)
//
// ************************************************************************
//@HEADER
*/

#include <gtest/gtest.h>

#include <stdexcept>
#include <sstream>
#include <iostream>

#include <Kokkos_Core.hpp>

namespace Test {

template< class Space >
void test_view_mapping()
{
  typedef typename Space::execution_space ExecSpace;

  typedef Kokkos::Experimental::Impl::ViewDimension<>  dim_0;
  typedef Kokkos::Experimental::Impl::ViewDimension< 2 > dim_s2;
  typedef Kokkos::Experimental::Impl::ViewDimension< 2, 3 > dim_s2_s3;
  typedef Kokkos::Experimental::Impl::ViewDimension< 2, 3, 4 > dim_s2_s3_s4;

  typedef Kokkos::Experimental::Impl::ViewDimension< 0 > dim_s0;
  typedef Kokkos::Experimental::Impl::ViewDimension< 0, 3 > dim_s0_s3;
  typedef Kokkos::Experimental::Impl::ViewDimension< 0, 3, 4 > dim_s0_s3_s4;

  typedef Kokkos::Experimental::Impl::ViewDimension< 0, 0 > dim_s0_s0;
  typedef Kokkos::Experimental::Impl::ViewDimension< 0, 0, 4 > dim_s0_s0_s4;

  typedef Kokkos::Experimental::Impl::ViewDimension< 0, 0, 0 > dim_s0_s0_s0;
  typedef Kokkos::Experimental::Impl::ViewDimension< 0, 0, 0, 0 > dim_s0_s0_s0_s0;
  typedef Kokkos::Experimental::Impl::ViewDimension< 0, 0, 0, 0, 0 > dim_s0_s0_s0_s0_s0;
  typedef Kokkos::Experimental::Impl::ViewDimension< 0, 0, 0, 0, 0, 0 > dim_s0_s0_s0_s0_s0_s0;
  typedef Kokkos::Experimental::Impl::ViewDimension< 0, 0, 0, 0, 0, 0, 0 > dim_s0_s0_s0_s0_s0_s0_s0;
  typedef Kokkos::Experimental::Impl::ViewDimension< 0, 0, 0, 0, 0, 0, 0, 0 > dim_s0_s0_s0_s0_s0_s0_s0_s0;

  // Fully static dimensions should not be larger than an int.
  ASSERT_LE( sizeof( dim_0 ), sizeof( int ) );
  ASSERT_LE( sizeof( dim_s2 ), sizeof( int ) );
  ASSERT_LE( sizeof( dim_s2_s3 ), sizeof( int ) );
  ASSERT_LE( sizeof( dim_s2_s3_s4 ), sizeof( int ) );

  // Rank 1 is size_t.
  ASSERT_EQ( sizeof( dim_s0 ), sizeof( size_t ) );
  ASSERT_EQ( sizeof( dim_s0_s3 ), sizeof( size_t ) );
  ASSERT_EQ( sizeof( dim_s0_s3_s4 ), sizeof( size_t ) );

  // Allow for padding.
  ASSERT_LE( sizeof( dim_s0_s0 ), 2 * sizeof( size_t ) );
  ASSERT_LE( sizeof( dim_s0_s0_s4 ), 2 * sizeof( size_t ) );

  ASSERT_LE( sizeof( dim_s0_s0_s0 ), 4 * sizeof( size_t ) );
  ASSERT_EQ( sizeof( dim_s0_s0_s0_s0 ), 4 * sizeof( unsigned ) );
  ASSERT_LE( sizeof( dim_s0_s0_s0_s0_s0 ), 6 * sizeof( unsigned ) );
  ASSERT_EQ( sizeof( dim_s0_s0_s0_s0_s0_s0 ), 6 * sizeof( unsigned ) );
  ASSERT_LE( sizeof( dim_s0_s0_s0_s0_s0_s0_s0 ), 8 * sizeof( unsigned ) );
  ASSERT_EQ( sizeof( dim_s0_s0_s0_s0_s0_s0_s0_s0 ), 8 * sizeof( unsigned ) );

  static_assert( int( dim_0::rank ) == int( 0 ), "" );
  static_assert( int( dim_0::rank_dynamic ) == int( 0 ), "" );
  static_assert( int( dim_0::ArgN0 ) == 1, "" );
  static_assert( int( dim_0::ArgN1 ) == 1, "" );
  static_assert( int( dim_0::ArgN2 ) == 1, "" );

  static_assert( int( dim_s2::rank ) == int( 1 ), "" );
  static_assert( int( dim_s2::rank_dynamic ) == int( 0 ), "" );
  static_assert( int( dim_s2::ArgN0 ) == 2, "" );
  static_assert( int( dim_s2::ArgN1 ) == 1, "" );

  static_assert( int( dim_s2_s3::rank ) == int( 2 ), "" );
  static_assert( int( dim_s2_s3::rank_dynamic ) == int( 0 ), "" );
  static_assert( int( dim_s2_s3::ArgN0 ) == 2, "" );
  static_assert( int( dim_s2_s3::ArgN1 ) == 3, "" );
  static_assert( int( dim_s2_s3::ArgN2 ) == 1, "" );

  static_assert( int( dim_s2_s3_s4::rank ) == int( 3 ), "" );
  static_assert( int( dim_s2_s3_s4::rank_dynamic ) == int( 0 ), "" );
